Tekla.Structures.Drawing.Tool_ObjectGeometry
This class handles all the calculation of any objects size and shape or visual layout

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetMinPoint(Tekla.Structures.Drawing.RectangleBoundingBox)
Gets the smallest point of the box

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetMaxPoint(Tekla.Structures.Drawing.RectangleBoundingBox)
Gets the largest point of the box

Tekla.Structures.Drawing.Tool_ObjectGeometry.RotatePoint(Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Geometry3d.Point)
Rotates a point around the center point by the specified angle (in radians).
Rotation adheres to the following rules for the new coordinates:
x' = x cos(a) + y sin(a)
y' = -x sin(a) + y cos(a)
point:
angle:
centerPoint:
Returns: The rotated point

Tekla.Structures.Drawing.Tool_ObjectGeometry.tool_deg_to_rad(System.Double)
Converts angle in degrees to radians
angleInDegrees:
Returns:

Tekla.Structures.Drawing.Tool_ObjectGeometry.tool_rad_to_deg(System.Double)
Converts angle in radians to degrees
angleInRadians:
Returns:

Tekla.Structures.Drawing.Tool_ObjectGeometry.EnlargeBoundingBoxIfrequiredToContainThisPoint(Tekla.Structures.Drawing.RectangleBoundingBox,Tekla.Structures.Geometry3d.Point)
Enlarges the bounding box if required to contain this point.
refBoundingBox: The reference bounding box.
P: The point.
Returns: A Bounding box containing the given point also.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetAxisAlignedBoundingBox(Tekla.Structures.Drawing.GridLine.GridLabel)
Retrieves the Axis-Aligned Rectangle_BoundingBox of the object.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetAxisAlignedBoundingBox(Tekla.Structures.Drawing.ViewBase)
Retrieves the Axis-Aligned Rectangle_BoundingBox of the object.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetObjectBoundingBox(Tekla.Structures.Drawing.GridLine.GridLabel)
Retrieves the Rectangle_BoundingBox of the object
(these are axis aligned by default, since these objects don't have an angle)

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetObjectBoundingBox(Tekla.Structures.Drawing.ViewBase)
Retrieves the Rectangle_BoundingBox of the object
(these are axis aligned by default, since these objects don't have an angle)

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetObjectAlignedBoundingBox(Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double)
Construct a RectangleBoundingBox from the BB width, height, angle and center point.
InsertionPoint:
Width:
Height:
Angle:
Returns: Returns the created bounding box.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetAxisAlignedBoundingBox(Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double)
Construct an axis aligned RectangleBoundingBox from the BB width, height, angle and center point.
InsertionPoint:
Width:
Height:
Angle:
Returns: Returns the created bounding box.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetObjectAlignedBoundingBox(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double)
Construct an object aligned RectangleBoundingBox from the start point, end point, and depths up and down.
StartPoint: The starting point of the box.
EndPoint: The ending point of the box.
DepthUp: The depth up that the rectangular box should cover.
DepthDown: The depth down that the rectangular box should cover.
Returns: Returns the created bounding box if successful, otherwise null.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetCircleCenterByThreePoints(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Gets center point of the circle by the given three points.
StartArcPoint: The start point of the arc.
MiddleArcPoint: The middle point of the arc.
EndArcPoint: The end point of the arc.
Returns: Returns the center point, or null if the point does not exist or cannot be found.

Tekla.Structures.Drawing.Tool_ObjectGeometry.GetExtremaOfCurvedBox(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@)
Gets the curved box extrema points by three arc points, view depth up and view depth down.
ArcPoint1: The start point of the arc.
ArcPoint2: The middle point of the arc.
ArcPoint3: The end point of the arc.
DepthUp: The depth up that the curved box should cover.
DepthDown: The depth down that the curved box should cover.
ExtremaMin: The minimum point is returned, if the arc points belong to unique circle.
ExtremaMax: The maximum point is returned, if the arc points belong to unique circle.
Returns: Returns true if the curved box extrema points were found, otherwise false.